#!/bin/bash
set -e
export PGPASSWORD=$APP_DB_PASS
psql $APP_DB_NAME $APP_DB_USER  <<-EOSQL

  -- Заполняем справочник city значениями
  INSERT INTO
    city (city_id, name)
  VALUES
  -- Устанавливаем значения по умолчанию, они должны быть обязательно записаны в справочник
  -- Значения повторяют те, что были в файле city.txt из предыдущей версии
    (59828,'МШИНСКАЯ'),
    (76628,'ПРИМОРСК'),
    (622578,'ПОБЕДА'),
    (72223,'ПЕТРОЗАВОДСК'),
    (17920,'ВЫБОРГ'),
  -- Далее остальные значения городов по желанию
    (82486,'САНКТ-ПЕТЕРБУРГ'),
    (59003,'МОСКВА'),
    (149840,'НОВОЕ ДЕВЯТКИНО'),
    (77881,'ПУШКИН'),
    (45674,'КРОНШТАДТ'),
    (44364,'КРАСНОЕ СЕЛО'),
    (105753,'ШУШАРЫ')
  ON CONFLICT (city_id)
  DO NOTHING;

  COMMIT;
EOSQL